[
  {
    "level": 2,
    "explanation": "<h2>Superposition state</h2><br/><p>Computers are deterministic, predictable machines and are designed to blindly follow sets of instructions in a repeatable manner. This nature of computers has of course served us extremely well through most of the last century, but this design comes with a fundamental flaw: it cannot perform random operations. Random number generators are an extremely important component of many applications today, but whilst the numbers they generate might be random enough, they are “pseudo” random and are often possible to predict or reverse engineer in some way.<br/><br/>Today it is possible to harness the strange, unpredictable nature of subatomic particles and use them to perform calculations inside a quantum computer.<br/><br/>To manipulate qubits in a quantum computer we use quantum gates much like the gates of a classical circuit. Whilst a classical computer can perform operations on bits such as flipping them to their opposite value, quantum gates can do these operations and more advanced quantum operations such as pushing a qubit into a superposition of both possible values. A gate that pushes a qubit into a superposition is called a Hadamard gate and is one of the most fundamental and commonly used logic gates in quantum computing [10].</p>",
    "formula": "$${\\displaystyle {\\frac {|0\\rangle +|1\\rangle }{\\sqrt {2}}}}$$",
    "registers": [
      [
        {
          "name": "H",
          "option": null
        }
      ]
    ]
  },
  {
    "level": 3,
    "explanation": "<h2>Entangled state</h2><br/><p>Quantum entanglement is a label for the observed physical phenomenon that occurs when a pair or group of particles is generated, interact, or share spatial proximity in a way such that the quantum state of each particle of the pair or group cannot be described independently of the state of the others, even when the particles are separated by a large distance. Therefore, two entangled objects O1 and O2 are not independent even if they are separed by a great distance, we have to consider (O1 + O2) as a unique system.</p>",
    "formula": "$${\\displaystyle {\\frac {|00\\rangle +|11\\rangle }{\\sqrt {2}}}}$$",
    "registers": [
      [
        {
          "name": "H",
          "option": null
        },
        {
          "name": "CX",
          "option": "control"
        }
      ],
      [
        {
          "name": null,
          "option": null
        },
        {
          "name": "CX",
          "option": "target"
        }
      ]
    ]
  },
  {
    "level": 4,
    "explanation": "<h2>Greenberger–Horne–Zeilinger state</h2><br/>Greenberger–Horne–Zeilinger state (GHZ state) is a certain type of entangled quantum state that involves at least three subsystems (particle states, or qubits).In simple words, it is a quantum superposition of all subsystems being in state 0 with all of them being in state 1 (states 0 and 1 of a single subsystem are fully distinguishable). The GHZ state is a maximally entangled quantum state.",
    "formula": "$${\\displaystyle {\\frac {|000\\rangle +|111\\rangle }{\\sqrt {2}}}}$$",
    "registers": [
      [
        {
          "name": "H",
          "option": null
        },
        {
          "name": "CX",
          "option": "control"
        },
        {
          "name": null,
          "option": null
        }
      ],
      [
        {
          "name": null,
          "option": null
        },
        {
          "name": "CX",
          "option": "target"
        },
        {
          "name": "CX",
          "option": "control"
        }
      ],
      [
        {
          "name": null,
          "option": null
        },
        {
          "name": null,
          "option": null
        },
        {
          "name": "CX",
          "option": "target"
        }
      ]
    ]
  },
  {
    "level": 5,
    "explanation": "<h2>Superdense coding</h2><br/>Quantum teleportation and superdense coding are closely related and might cause confusion if not properly explained or differentiate. Quantum teleportation is a process by which the state of qubit ( |𝜓⟩ ) can be transmitted from one location to another, with the help of classical communication and a Bell pair. In other words, we can say it is a protocol that destroys the quantum state of a qubit in one location and recreates it on a qubit at a distant location, with the help of shared entanglement. Superdense coding is a procedure that allows someone to send two classical bits to another party using just a single qubit of communication. The teleportation protocol is actually a flipped version of the superdense coding protocol, in the sense that Alice and Bob merely \"swap their equipment.\"",
    "formula": "$$\\frac{1}{\\sqrt2}(|00\\rangle + |11\\rangle)$$",
    "registers": [
      [
        {
          "name": "barrier",
          "option": null
        },
        {
          "name": "H",
          "option": null
        },
        {
          "name": "CX",
          "option": "control"
        },
        {
          "name": "barrier",
          "option": null
        },
        {
          "name": "Z",
          "option": null
        },
        {
          "name": "X",
          "option": null
        },
        {
          "name": "barrier",
          "option": null
        },
        {
          "name": "CX",
          "option": "control"
        },
        {
          "name": "H",
          "option": null
        },
        {
          "name": "barrier",
          "option": null
        }
      ],
      [
        {
          "name": "barrier",
          "option": null
        },
        {
          "name": null,
          "option": null
        },
        {
          "name": "CX",
          "option": "target"
        },
        {
          "name": "barrier",
          "option": null
        },
        {
          "name": null,
          "option": null
        },
        {
          "name": null,
          "option": null
        },
        {
          "name": "barrier",
          "option": null
        },
        {
          "name": "CX",
          "option": "target"
        },
        {
          "name": null,
          "option": null
        },
        {
          "name": "barrier",
          "option": null
        }
      ]
    ]
  }
]
